#+TITLE:Selection
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:CSC100 Introduction to programming in C/C++ (Summer 2022)
#+STARTUP: overview hideblocks indent
#+OPTIONS: toc:1 ^:nil
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :exports both :results output :comments both
** Overview and example

- ~If~ statement structure in C is very similar to pseudocode

- [[battle1]] is the C version of the pseudocode [[problem1]] from earlier.

     #+name: battle1
     #+begin_example C
     if (health <= 100)
       // drink health potion
     else
       //resume battle
     #+end_example

- Differences: condition needs /parentheses/; no "end if" statement

- The ~health~ check results in a /Boolean/ answer: ~true~ or ~false~
    - To run, the program needs a declaration of the ~health~ variable

- Multiple statements need to be included in braces

- Here is a version that will run. The variable has been initialized

     #+name: battle2
     #+begin_src C :main yes :includes <stdio.h> :results output
       int health = 99;

       if (health <= 100) {
         // drink health potion
         printf("Drinking health potion!\n");
        }
        else {
          // resume battle
          printf("Resuming battle!\n");
        }
     #+end_src

     #+RESULTS: battle2
     : Drinking health potion!

** Battle by numbers

   * The last version [[battle3]] below reads input from a file.

     #+name: battleinput
     #+begin_src bash :results silent
       echo "1" > ../src/drink
     #+end_src

   * We only have two simple if structures, and no nesting.

     #+name: battle3
     #+begin_src C :tangle battle.c :main yes :includes <stdio.h> :cmdline < drink :results output
       int response = 0; // initialize response

       puts("\n\tIn-Battle Healing\n\n1:\tDrink health potion\n\n2:\tResume battle\n");

       printf("\nEnter your selection: ");
       scanf("%d", &response);

       if (response == 1)
         printf("\nDrinking health potion!\n");

       if (response == 2)
         printf("\nResuming battle!\n");

     #+end_src

     #+RESULTS: battle3
     #+begin_example

	     In-Battle Healing

     1:	Drink health potion

     2:	Resume battle


     Enter your selection: 
     Drinking health potion!
     #+end_example

   * You can also tangle the file and run ~battle.c~ from the
     commandline:

     #+begin_example bash
       C-c C-v t
       gcc -o battle battle.c
       battle
     #+end_example

* Order of operator operations

  * In compound operations (multiple operators), you need to know the
    order of operator precedence

  * C has almost 50 operators. The most unusual are compound
    increment/decrement operators[fn:4]:

    | STATEMENT  | COMPOUND | PREFIX | POSTFIX |
    |------------+----------+--------+---------|
    | i = i + 1; | i += 1;  | ++i;   | i++;    |
    | j = j - 1; | j -= 1;  | --i;   | i--;    |

  * ++ and -- have side effects: they modify the values of their
    operands: ++i yields i+1 and increments i:

    #+name: prefix
    #+begin_src C :results output :exports both
      int i = 1;
      printf("i is %d\n", ++i);  // prints "i is 2"
      printf("i is %d\n", i);  // prints "i is 2"
    #+end_src

    #+RESULTS: prefix
    : i is 2
    : i is 2

    #+name: postfix
    #+begin_src C :results output :exports both
      int j = 1;
      printf("j is %d\n", j++);  // prints "j is 1"
      printf("j is %d\n", j);  // prints "j is 2"
    #+end_src

    #+RESULTS: postfix
    : j is 1
    : j is 2

  * Here is another illustration with an assignment of post and prefix
    increment operators:

    #+name: postfixprefix
    #+begin_src C :exports both :results output
      int num1 = 10, num2 = 0;
      puts("start: num1 = 10, num2 =0");

      num2 = num1++;
      printf("num2 = num1++, so num2 = %d, num1 = %d\n", num2, num1);

      num1 = 10;
      num2 = ++num1;
      printf("num2 = ++num1, so num2 = %d, num1 = %d\n", num2, num1);
    #+end_src

    #+RESULTS: postfixprefix
    : start: num1 = 10, num2 =0
    : num2 = num1++, so num2 = 10, num1 = 11
    : num2 = ++num1, so num2 = 11, num1 = 11

  * The table [[order]] shows a partial list of operators and their
    order of precedence from 1 (highest precedence, i.e. evaluated
    first) to 5 (lowest precedence, i.e. evaluated last)

    #+name: order
    | ORDER | OPERATOR            | SYMBOL           | ASSOCIATIVITY |
    |-------+---------------------+------------------+---------------|
    |     1 | increment (postfix) | ++               | left          |
    |       | decrement (postfix) | --               |               |
    |-------+---------------------+------------------+---------------|
    |     2 | increment (prefix)  | ++               | right         |
    |       | decrement (prefix)  | --               |               |
    |       | unary plus          | +                |               |
    |       | unary minus         | -                |               |
    |-------+---------------------+------------------+---------------|
    |     3 | multiplicative      | * / %            | left          |
    |-------+---------------------+------------------+---------------|
    |     4 | additive            | + -              | left          |
    |-------+---------------------+------------------+---------------|
    |     5 | assignment          | = *= /= %= += -= | right         |

  * Left/right associativity means that the operator groups from
    left/right. Examples:

    #+name: associativity
    | EXPRESSION | EQUIVALENCE | ASSOCIATIVITY |
    |------------+-------------+---------------|
    | i - j - k  | (i - j) - k | left          |
    | i * j / k  | (i * j) / k | left          |
    | -+j        | - (+j)      | right         |
    | i %=j      | i = (i % j) | right         |
    | i +=j      | i = (j + 1) | right         |

  * [ ] Make sure to write some of these out yourself and run
    examples. I found ~%=~ quite challenging: a modulus and assignment
    operator. ~i %= j~ computes ~i%j~ (i modulus j) and assigns it to
    ~i~.

    What is the value of ~i~ after running the code below?

    #+name: %=
    #+begin_src C :exports both
      int i = 10, j = 5;
      i%=j;
      printf("i was 10 and is now %d = 10 %% 5\n", i);
    #+end_src

    #+RESULTS: %=
    : i was 10 and is now 0 = 10 % 5


  * [ ] Let's write a program [[compound_check]] to check the equivalence
    claimed in the table [[compound]].

    #+name: compound
    | OPERATOR | EXAMPLE | EQUIVALENT TO |
    |----------+---------+---------------|
    | +=       | a += b  | a = a + b     |
    | -=       | a -= b  | a = a - b     |
    | *=       | a *= b  | a = a * b     |
    | /=       | a /= b  | a = a / b     |
    | %=       | a %= b  | a = a % b     |

    #+name: compound_check
    #+begin_src C :results output :exports both
      int a = 10, b = 2;

      printf("10 += 2 is %d\n", a += b); a = 10; b = 2;
      printf("10 -= 2 is %d\n", a -= b); a = 10; b = 2;
      printf("10 *= 2 is %d\n", a *= b); a = 10; b = 2;
      printf("10 /= 2 is %d\n", a /= b); a = 10; b = 2;
      printf("10 %%= 2 is %d\n", a %= b);
    #+end_src

    #+RESULTS: compound_check
    : 10 += 2 is 12
    : 10 -= 2 is 8
    : 10 *= 2 is 20
    : 10 /= 2 is 5
    : 10 %= 2 is 0


  * [ ] Using the table [[order]], parenthesize the following expression:

    #+name: simplify
    #+begin_example C
    a = b += c++ -d + --e / -f
    #+end_example

    Group 1:
    #+begin_example C
    a = b += (c++) -d + --e / -f
    #+end_example

    Group 2:
    #+begin_example C
    a = b += (c++) -d + (--e) / (-f)
    #+end_example

    Group 3:
    #+begin_example C
    a = b += ((c++) -d) + ((--e) / (-f))  // -,+ group from left to right
    #+end_example

    Group 4:
    #+begin_example C
    (a = (b += ((c++) -d) + ((--e) / (-f))))) // =, += group from right to left
    #+end_example

    Much better to write this like as a series of commands:
    #+begin_example C
    c++;  // c = c + 1
    e--;  // e = e - 1
    -f;   // f = -f
    c = c - d;
    e = e / f;
    b = b + c + e;
    a = b;
    #+end_example

** Booleans in C

   * C evaluates all non-zero values as TRUE, and all zero values as
     FALSE:

     #+name: boolean
     #+begin_src C :results output :exports both
       if (3) puts("3 is TRUE"); // non-zero expression
       if (!0) puts("0 is FALSE"); // !0 is literally non-zero
     #+end_src

     #+RESULTS: boolean
     : 3 is TRUE
     : 0 is FALSE
 
   * The Boolean operators AND, OR and NOT are represented in C by
     the logical operators ~&&~, ~||~ and ~!~, respectively

** ! operator

   * The ! operator is a "unary" operator that is evaluated from the
     left. It is TRUE when its argument is FALSE, and vice versa.

   * [X] If ~i = 100~, what is ~!i~?

   * [X] If ~j = 1.0e-15~, what is ~!i~?

   * Let's check!

     #+name: negation
     #+begin_src C :results output :exports both
       int i = 100;
       double j = 1.e-15;
       printf("!%d is %d because %d is non-zero!\n", i, !i, i);
       printf("!(%.1e) is %d because %.1e is non-zero!\n", j, !j, j);
     #+end_src

     #+RESULTS: negation
     : !100 is 0 because 100 is non-zero!
     : !(1.0e-015) is 0 because 1.0e-015 is non-zero!

** && operator (logical AND)

   * Evaluates a Boolean expression from left to right

   * Value is TRUE if and only if both sides of the operator are TRUE

   * Examples:

     #+name: &&_op_true
     #+begin_src C :exports both
       if ( 3 > 1 && 5 < 10 ) // = TRUE AND TRUE = TRUE
         printf("The entire expression is true.\n");
     #+end_src

     #+RESULTS: &&_op_true
     : The entire expression is true.

     #+name: &&_op_false
     #+begin_src C :exports both
       if (!(3 > 5 && 5 < 5) ) // = NOT (FALSE AND FALSE) = TRUE
         printf("The entire expression (except the !) is false.\n");
     #+end_src

     #+RESULTS: &&_op_false
     : The entire expression (except the !) is false.

** || operator (logical OR)

   * Evaluates a Boolean expression from left to right

   * It is FALSE if and only if both sides of the operator are FALSE

   * It is TRUE if either side of the operator is TRUE

   * Examples:

     #+name: ||_op_true
     #+begin_src C :exports both
       if ( 3 > 5 || 5 == 5 ) // TRUE OR TRUE = TRUE
         printf("The entire expression is true.\n");
     #+end_src

     #+RESULTS: ||_op_true
     : The entire expression is true.

     Remember to use the logical comparison operator ==, and not the
     assignment operator =
     
     #+name: ||_op_false
     #+begin_src C :exports both
       if ( 3 > 5 || 6 < 5 ) { }// = FALSE OR FALSE = FALSE
        else printf("The entire expression is false.\n");
     #+end_src
     
   * Practice that using the GDrive notebook!

** Checking for upper and lower case

   * Characters are represented by ASCII[fn:5] character sets

   * E.g. ~a~ and ~A~ are represented by the ASCII codes 97 and 65,
     resp.

   * [ ] Let's check that.

     #+name: ascii_input
     #+begin_src bash :results silent
       echo "a A" > ascii
     #+end_src

     #+name: ascii
     #+begin_src C :cmdline < ascii :results output :export both
       char a, A;
       scanf("%c %c", &a, &A);
       printf("The ASCII value of %c is %d\n", a, a);
       printf("The ASCII value of %c is %d\n", A, A);
     #+end_src

     #+RESULTS: ascii
     : The ASCII value of a is 97
     : The ASCII value of A is 65

   * User-friendly programs should use compound conditions to check
     for both lower and upper case letters:

     #+name: ascii_both
     #+begin_example C
     if (response == 'A' || response == 'a')
     #+end_example

   * Practice that using the GDrive notebook!

** Checking for a range of values

   * To validate input, you often need to check a range of values

   * This is a common use of compound conditions, logical and
     relational operators

   * We first create an input file ~num~.

     #+name: valid_input
     #+begin_src bash :results silent
       echo 5 > num
     #+end_src

   * [ ] What does the code in [[validate]] do? Will it run? What will the
     output be for our choice of input?

     #+name: validate
     #+begin_src C :cmdline < num :exports both

       int response = 0;

       scanf("%d", &response);

       if ( response < 1 || response > 10 ) {
         puts("Number not in range.");
        } else {
         puts("Number in range.");
        }
     #+end_src

     #+RESULTS: validate
     : Number in range.

   * Head to the practice notebook for some challenging exercises!

** Simple example

   * In the example code [[switch]], the ~grade~ is set in the variable
     declaration. Depending on the value, a ~case~ is triggered and
     the corresponding statements are executed.

   * [ ] What is the output of the code in [[switch]] for different
     values:
     | VALUE | OUTPUT        |
     |-------+---------------|
     |     5 | Failing       |
     |     3 | Passing       |
     |     0 | Illegal grade |
     |    -1 | Illegal grade |
     |   0.5 | Illegal grade |

     What does the program implement?

     #+name: switch
     #+begin_src C :results output :exports both
       int grade = 3;

       switch (grade) {
        case 4:
        case 3:
        case 2:
        case 1:
          printf("Passing");
          break;
        case 5:
        case 6:
          printf("Failing");
          break;
        default:
          printf("Illegal grade");
          break;
        }
     #+end_src

     #+RESULTS: switch
     : Illegal grade

   * [ ] Q: Which problem/solution set does the program implement?

     #+begin_quote
     Answer: The program reflects "passing" grades 4,3,2,1, and "failing"
     grade 0. Any other grade value is not allowed. (This happens to be
     the European grade scale, which is A = 1 to D = 4, and F = 5 or 6.)
     #+end_quote

   * You can also put several case labels on the same line as in
     [[switch1]], which is otherwise identical to [[switch]].

     #+name: switch1
     #+begin_src C :results output :exports both
       int grade = 3;

       switch (grade) {
        case 4: case 3: case 2: case 1:
          printf("Passing");
          break;
        case 5: case 6:
          printf("Failing");
          break;
        default:
          printf("Illegal grade");
          break;
        }
     #+end_src

     #+RESULTS: switch1
     : Passing

   * Note: You cannot write a case label for a range of values.

   * The default case (when none of the case expressions apply) is
     optional, and it does not have to come last.

